tutorials/heatTransfer/chtMultiRegionFoam/externalSolarLoad/0/floor/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev-OpenCFD                           |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/floor";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 300;

boundaryField
{
    maxY
    {
        type            zeroGradient;
        value           uniform 300;
    }
    minX
    {
        type            zeroGradient;
        value           uniform 300;
    }
    maxX
    {
        type            zeroGradient;
        value           uniform 300;
    }
    minY
    {
        type            zeroGradient;
        value           uniform 300;
    }
    minZ
    {
        type            externalWallHeatFluxTemperature;
        value           uniform 300;
        kappa           solidThermo;
        Ta              uniform 313;
        h               uniform 1000000;
        thicknessLayers ( 1 2 );
        kappaLayers     ( 100 200 );
        kappaName       none;
    }
    floor_to_domain3
    {
        type            zeroGradient;
        value           uniform 300;
    }
    floor_to_air
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
        value           uniform 300;
        Tnbr            T;
        kappa           solidThermo;
        QrNbr           Qr;
        Qr              none;
        kappaName       none;
    }
    floor_to_solid
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
        value           uniform 300;
        Tnbr            T;
        kappa           solidThermo;
        QrNbr           none;
        Qr              none;
        kappaName       none;
    }
}


// ************************************************************************* //
