tutorials/heatTransfer/chtMultiRegionFoam/externalSolarLoad/constant/air/boundaryRadiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      boundaryRadiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    ".*"
    {
        type            boundaryRadiation;
        mode            lookup;
        emissivity      uniform 1.0;
        absorptivity    uniform 0.0;
        transmissivity  uniform 1.0;

        value           uniform 0.0;
    }

    air_to_solid
    {
        type            boundaryRadiation;
        mode            solidRadiation;
        value           uniform 0;
    }

    air_to_floor
    {
        type            boundaryRadiation;
        mode            solidRadiation;
        value           uniform 0;
    }

}

// ************************************************************************* //
